package com.example.tasbih;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;
import android.widget.Toast;

import androidx.annotation.ColorLong;
import androidx.annotation.Nullable;

public class MydatabaseHelper  extends SQLiteOpenHelper {
    private Context context;
    private SQLiteDatabase db;
    private static final String DATABASE_NAME = "DatabaseApp.db";
    private static final int DATABASE_VERSION = 1;
    private static final String TABLE_NAME = "quran_messages";
    private static final String COLUMN_ID = "_id";
    private static final String COLUMN_AYA = "aya";
    private static final String COLUMN_SOURCE = "source";
    public MydatabaseHelper(@Nullable Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
        this.context = context;

    }
    public SQLiteDatabase getDatabase() {
        if (db == null || !db.isOpen()) {
            db = getWritableDatabase();
        }
        return db;
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        String query = "CREATE TABLE " + TABLE_NAME +
                " (" + COLUMN_ID + " INTEGER PRIMARY KEY AUTOINCREMENT, " +
                COLUMN_AYA + " TEXT, " +
                COLUMN_SOURCE + " TEXT);";
        db.execSQL(query);
        query="CREATE TABLE ADKAR ( _idAdk INTEGER PRIMARY KEY AUTOINCREMENT, DIK_TEXT TEXT, DIKR_NbR INTEGER, DIKR_TYPE TEXT, DIKR_Source TEXT);";
        db.execSQL(query);
        query="CREATE TABLE progress (\n" +
                "  _idProg INTEGER PRIMARY KEY AUTOINCREMENT,\n" +
                "  date DATE DEFAULT (strftime('%Y-%m-%d', 'now', 'localtime')),\n" +
                "  Fajer INTEGER NOT NULL DEFAULT 0,\n" +
                "  Doher INTEGER NOT NULL DEFAULT 0,\n" +
                "  Aser INTEGER NOT NULL DEFAULT 0,\n" +
                "  Magrib INTEGER NOT NULL DEFAULT 0,\n" +
                "  Icha INTEGER NOT NULL DEFAULT 0\n" +
                ");";
        db.execSQL(query);
        addmessages(db);
        addDiks(db);


    }



    void addmessages(SQLiteDatabase db){
        addMessage(db,"﴿ وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَ أَنْتُمْ ٱلْأَعْلَوْنَ إِنْ كُنتُمْ مُّومِنِين﴾.َ","آل عِمْرَانْ الآية: 139");
        addMessage(db,"﴿ إِنْ يَّمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ ٱلْقَوْمَ قَرْحٌ مِثْلُهُ وَ تِلْكَ ٱلأَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاس﴾.","آل عِمْرَانْ الآية :140");
        addMessage(db,"﴿ وَمَنْ يَعْتَصِمْ بِٱللَّهِ فَقَدْ هُدِيَ إِلَى صِرَاطٍ مُّسْتَقِيمٍ﴾.","آل عِمْرَانْ الآية 101:");
        addMessage(db,"﴿ اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا ۖ وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِّنَ اللَّهِ وَرِضْوَانٌ ۚ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ﴾.","الحديد الآية: 20");
        addMessage(db,"﴿ سَابِقُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ﴾.","الحديدْ الآية: 21");
        addMessage(db,"﴿ وَلَئِنْ سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ قُلْ أَبِاللَّهِ وَآيَاتِهِ وَرَسُولِهِ كُنتُمْ تَسْتَهْزِئُونَ لا تَعْتَذِرُوا قَدْ كَفَرْتُمْ بَعْدَ إِيمَانِكُمْ﴾.","التوبةالآية:65-66");
        addMessage(db,"﴿ فَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُعَذِّبَهُم بِهَا فِي الْحَيَاةِ الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ ﴾.","التوبةالآية:55 ");
        addMessage(db,"﴿ قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوْلَىٰنَا ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ﴾.","التوبةالآية:50");
        addMessage(db,"﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا مَا لَكُمْ إِذَا قِيلَ لَكُمُ انفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الْأَرْضِ ۚ أَرَضِيتُم بِالْحَيَاةِ الدُّنْيَا مِنَ الْآخِرَةِ ۚ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الْآخِرَةِ إِلَّا قَلِيلٌ﴾.","التوبةالآية:38");
        addMessage(db,"﴿سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَإِن يَرَوْا كُلَّ آيَةٍ لَّا يُؤْمِنُوا بِهَا وَإِن يَرَوْا سَبِيلَ الرُّشْدِ لَا يَتَّخِذُوهُ سَبِيلًا وَإِن يَرَوْا سَبِيلَ الْغَيِّ يَتَّخِذُوهُ سَبِيلًا ۚ ذَٰلِكَ بِأَنَّهُمْ كَذَّبُوا بِآيَاتِنَا وَكَانُوا عَنْهَا غَافِلِينَ ﴾."," الأعراف الآية:146 ");
        addMessage(db,"﴿ وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ جَاءَتْهُمْ آيَةٌ لَيُؤْمِنُنَّ بِهَا قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ وَمَا يُشْعِرُكُمْ أَنَّهَا إِذَا جَاءَتْ لَا يُؤْمِنُونَ وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ ﴾.","الأنعام الآية:109-110");
        addMessage(db,"﴿ وَذَرِ ٱلَّذِينَ ٱتَّخَذُواْ دِينَهُمْ لَعِبًا وَلَهْوًا وَغَرَّتْهُمُ ٱلْحَيَوٰةُ ٱلدُّنْيَا ۚ وَذَكِّرْ بِهِۦٓ أَن تُبْسَلَ نَفْسٌۢ بِمَا كَسَبَتْ لَيْسَ لَهَا مِن دُونِ ٱللَّهِ وَلِىٌّ وَلَا شَفِيعٌ وَإِن تَعْدِلْ كُلَّ عَدْلٍۢ لَّا يُؤْخَذْ مِنْهَآ ۗ أُوْلَٰٓئِكَ ٱلَّذِينَ أُبْسِلُواْ بِمَا كَسَبُواْ ۖ لَهُمْ شَرَابٌ مِّنْ حَمِيمٍۢ وَعَذَابٌ أَلِيمٌۢ بِمَا كَانُواْ يَكْفُرُونَ﴾.","الأنعام الآية:70");
        addMessage(db,"﴿ وَمَا نُرْسِلُ ٱلْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ ۖ فَمَنْ ءَامَنَ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونََ﴾.","الأنعام الآية:48");
        addMessage(db,"﴿ فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦ فَتَحْنَا عَلَيْهِمْ أَبْوَٰبَ كُلِّ شَىْءٍ حَتَّىٰٓ إِذَا فَرِحُواْ بِمَآ أُوتُوٓاْ أَخَذْنَٰهُم بَغْتَةً فَإِذَا هُم مُّبْلِسُون ﴾.َ","الأنعام الآية:44");
        addMessage(db," ﴿وَكَيْفَ تَكْفُرُونَ وَأَنتُمْ تُتْلَىٰ عَلَيْكُمْ ءَايَٰتُ ٱللَّهِ وَفِيكُمْ رَسُولُهُۥ ۗ وَمَن يَعْتَصِم بِٱللَّهِ فَقَدْ هُدِىَ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ ﴾.","آل عِمْرَانْ الآية :101");
        addMessage(db,"﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ ﴾.","آل عِمْرَانْ الآية :102");
        addMessage(db,"﴿ وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا ۚ وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِ إِخْوَانًا وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِّنَ النَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَهْتَدُونَ ﴾.","آل عِمْرَانْ الآية :103");
        addMessage(db,"﴿ قُلْ يَٰعِبَادِىَ ٱلَّذِينَ أَسْرَفُواْ عَلَىٰٓ أَنفُسِهِمْ لَا تَقْنَطُواْ مِن رَّحْمَةِ ٱللَّهِ ۚ إِنَّ ٱللَّهَ يَغْفِرُ ٱلذُّنُوبَ جَمِيعًا ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ ﴾.","الزمر الآية :53");
        addMessage(db,"﴿ وَأَنِيبُوا إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا لَهُ مِن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنصَرُونَ وَاتَّبِعُوا أَحْسَنَ مَا أُنزِلَ إِلَيْكُم مِّن رَّبِّكُم مِّن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنتُمْ لَا تَشْعُرُون أَن تَقُولَ نَفْسٌ يَا حَسْرَتَا عَلَىٰ مَا فَرَّطتُ فِي جَنبِ اللَّهِ وَإِن كُنتُ لَمِنَ السَّاخِرِينَ ﴾.","الزمر الآية : 54-55-56 ");
        addMessage(db,"﴿ أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنتُ مِنَ الْمُتَّقِينَ  أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ  بَلَىٰ قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنتَ مِنَ الْكَافِرِينَ ﴾.","الزمر الآية : 57-58-59");
        addMessage(db,"﴿ بَلِ اللَّهَ فَاعْبُدْ وَكُن مِّنَ الشَّاكِرِينَ  وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ ﴾.","الزمر الآية : 66-67");
        addMessage(db,"﴿ فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ الَّذِينَ لَا يُوقِنُونَ ﴾.","الروم الآية : 60");
        addMessage(db,"﴿ ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُم بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ ﴾.","الروم الآية : 41");
        addMessage(db,"﴿ فَإِن لَّمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِّنَ اللَّهِ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ ﴾.","القصص الآية : 50");
        addMessage(db,"﴿ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ وَيَخْشَ ٱللَّهَ وَيَتَّقْهِ فَأُوْلَٰٓئِكَ هُمُ ٱلْفَآئِزُونَ ﴾.","النور الآية : 52");
        addMessage(db,"﴿ قَدْ جَاءَكُم بَصَائِرُ مِن رَّبِّكُمْ ۖ فَمَنْ أَبْصَرَ فَلِنَفْسِهِ ۖ وَمَنْ عَمِيَ فَعَلَيْهَا ۚ وَمَا أَنَا عَلَيْكُم بِحَفِيظٍ ﴾.","الأنعام الآية : 104");
        addMessage(db,"﴿ الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ أُولَٰئِكَ لَهُمُ الْأَمْنُ وَهُم مُّهْتَدُونَ ﴾.","الأنعام الآية : 82");
        addMessage(db,"﴿ وَقَالُوا إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ  وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَىٰ رَبِّهِمْ ۚ قَالَ أَلَيْسَ هَٰذَا بِالْحَقِّ ۚ قَالُوا بَلَىٰ وَرَبِّنَا ۚ قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ  قَدْ خَسِرَ الَّذِينَ كَذَّبُوا بِلِقَاءِ اللَّهِ ۖ حَتَّىٰ إِذَا جَاءَتْهُمُ السَّاعَةُ بَغْتَةً قَالُوا يَا حَسْرَتَنَا عَلَىٰ مَا فَرَّطْنَا فِيهَا وَهُمْ يَحْمِلُونَ أَوْزَارَهُمْ عَلَىٰ ظُهُورِهِمْ ۚ أَلَا سَاءَ مَا يَزِرُونَ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا لَعِبٌ وَلَهْوٌ ۖ وَلَلدَّارُ الْآخِرَةُ خَيْرٌ لِّلَّذِينَ يَتَّقُونَ ۗ أَفَلَا تَعْقِلُونَ ﴾.","الأنعام الآية : 29-30-31-32");
        addMessage(db,"﴿ وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا أَيْنَ شُرَكَاؤُكُمُ الَّذِينَ كُنتُمْ تَزْعُمُونَ ثُمَّ لَمْ تَكُن فِتْنَتُهُمْ إِلَّا أَن قَالُوا وَاللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ انظُرْ كَيْفَ كَذَبُوا عَلَىٰ أَنفُسِهِمْ ۚ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْكَ ۖ وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۚ وَإِن يَرَوْا كُلَّ آيَةٍ لَّا يُؤْمِنُوا بِهَا ۚ حَتَّىٰ إِذَا جَاءُوكَ يُجَادِلُونَكَ يَقُولُ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْأَوْنَ عَنْهُ ۖ وَإِن يُهْلِكُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَى النَّارِ فَقَالُوا يَا لَيْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِآيَاتِ رَبِّنَا وَنَكُونَ مِنَ الْمُؤْمِنِينَ ﴾.","الأنعام الآية : 22-23-24-25-26-27");
        addMessage(db,"﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُم ْ﴾.","المائدة الآية : 105");
        addMessage(db,"﴿ إِن يَنصُرْكُمُ اللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِن يَخْذُلْكُمْ فَمَن ذَا الَّذِي يَنصُرُكُم مِّن بَعْدِهِ ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ﴾.","آل عِمْرَانْ الآية :160");
        addMessage(db,"﴿ زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاءِ وَالْبَنِينَ وَالْقَنَاطِيرِ الْمُقَنطَرَةِ مِنَ الذَّهَبِ وَالْفِضَّةِ وَالْخَيْلِ الْمُسَوَّمَةِ وَالْأَنْعَامِ وَالْحَرْثِ ۗ ذَٰلِكَ مَتَاعُ الْحَيَاةِ الدُّنْيَا ۖ وَاللَّهُ عِندَهُ حُسْنُ الْمَآبِ ﴾.","آل عِمْرَانْ الآية :14");
        addMessage(db,"﴿ رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ ﴾.","آل عِمْرَانْ الآية :8");
        addMessage(db,"﴿ وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ ﴾.","البقرة الآية :186");
        addMessage(db,"﴿ إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ  لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيم وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ ﴾.","التكوير الآية :27");
        addMessage(db,"﴿ وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ ﴾.","الصف الآية :5");
        addMessage(db,"﴿ رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُواْ وَٱغْفِرْ لَنَا رَبَّنَآ ۖ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ ﴾.","الممتحنة الآية :5");
        addMessage(db,"﴿ لَن تَنفَعَكُمْ أَرْحَامُكُمْ وَلَا أَوْلَادُكُمْ ۚ يَوْمَ الْقِيَامَةِ يَفْصِلُ بَيْنَكُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ ﴾.","الممتحنة الآية :3");
        addMessage(db,"﴿يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنسَاهُمْ أَنفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ ﴾.َ","الحشر الآية :18-19");
        addMessage(db,"﴿ وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ ﴾.َ","الحشر الآية :9");
        addMessage(db,"﴿ يَوْمَ يَبْعَثُهُمُ اللَّهُ جَمِيعًا فَيَحْلِفُونَ لَهُ كَمَا يَحْلِفُونَ لَكُمْ ۖ وَيَحْسَبُونَ أَنَّهُمْ عَلَىٰ شَيْءٍ ۚ أَلَا إِنَّهُمْ هُمُ الْكَاذِبُونَ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ فَأَنسَاهُمْ ذِكْرَ اللَّهِ ۚ أُولَٰئِكَ حِزْبُ الشَّيْطَانِ ۚ أَلَا إِنَّ حِزْبَ الشَّيْطَانِ هُمُ الْخَاسِرُونَ ﴾.","المجادلة الآية :18-19");
        addMessage(db,"﴿ أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَن تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ ۖ وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ ﴾.","الحديدْ الآية: 16");
        addMessage(db,"﴿ أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا إِنَّ الَّذِينَ ارْتَدُّوا عَلَىٰ أَدْبَارِهِم مِّن بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ  ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ ۖ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ  فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ  ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ أَن لَّن يُخْرِجَ اللَّهُ أَضْغَانَهُمْ ﴾.","محمد الآية : 24-25-26-27-28-29");
        addMessage(db,"﴿ إِنَّهُمْ لَن يُغْنُوا عَنكَ مِنَ اللَّهِ شَيْئًا ۚ وَإِنَّ الظَّالِمِينَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۖ وَاللَّهُ وَلِيُّ الْمُتَّقِينَ ﴾.","الجاثية الآية :19");
        addMessage(db,"﴿ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴾.","البقرة الآية :286");
        addMessage(db,"﴿ إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ ﴾.","البقرة الآية :277");
        addMessage(db,"﴿ وَالَّذِينَ هُمْ بِشَهَادَاتِهِمْ قَائِمُونَ وَالَّذِينَ هُمْ عَلَىٰ صَلَاتِهِمْ يُحَافِظُونَ أُولَٰئِكَ فِي جَنَّاتٍ مُكْرَمُونَ ﴾.","المعارج الآية:33-34-35");
        addMessage(db,"﴿ لِيُنفِقْ ذُو سَعَةٍ مِّن سَعَتِهِ ۖ وَمَن قُدِرَ عَلَيْهِ رِزْقُهُ فَلْيُنفِقْ مِمَّا آتَاهُ اللَّهُ ۚ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا ۚ سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا ﴾.","الطلاق الآية:7");
        addMessage(db,"ۚ﴿ وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا ﴾.","الطلاق الآية:2-3");
        addMessage(db,"﴿ ذَٰلِكَ أَمْرُ اللَّهِ أَنزَلَهُ إِلَيْكُمْ ۚ وَمَن يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا ﴾.","الطلاق الآية:5");
        addMessage(db,"﴿ وَلَقَدْ خَلَقْنَا الْإِنسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيد ﴾.ِ","سورة ق الآية:16");
        addMessage(db,"﴿  مَّا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ وَجَاءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ۖ ذَٰلِكَ مَا كُنتَ مِنْهُ تَحِيدُ وَنُفِخَ فِي الصُّورِ ۚ ذَٰلِكَ يَوْمُ الْوَعِيدِ  وَجَاءَتْ كُلُّ نَفْسٍ مَّعَهَا سَائِقٌ وَشَهِيدٌ  لَّقَدْ كُنتَ فِي غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ  ﴾.ِ","سورة ق الآية:18-19-20-21-22");
        addMessage(db,"﴿ أَفَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ وَيَهْدِي مَن يَشَاءُ ۖ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ ۚ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَصْنَعُونَ ﴾.ِ","فاطر الآية:8");
    }
    void addMessage(SQLiteDatabase db,String aya, String source){
        ContentValues cv = new ContentValues();
        cv.put(COLUMN_AYA,aya);
        cv.put(COLUMN_SOURCE,source);
        long result = db.insert(TABLE_NAME,null, cv);
        if(result == -1){
            Toast.makeText(context, "Failed", Toast.LENGTH_SHORT).show();
        }else {
           // Toast.makeText(context, "secceded", Toast.LENGTH_SHORT).show();
        }
    }
    void addDiks(SQLiteDatabase db){
        this.addDikr(db,"يجمع كفيه ثم ينفث فيهما والقراءة فيهما قل هو الله أحد قل أعوذ برب الفلق وقل أعوذ برب الناس ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده",3,"أذكار النوم","عَنْ عَائِشَةَ رضي الله عنها : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ كُلَّ لَيْلَةٍ : جَمَعَ كَفَّيْهِ ، ثُمَّ نَفَثَ فِيهِمَا ، فَقَرَأَ فِيهِمَا : قُلْ هُوَ اللَّهُ أَحَدٌ ، وَ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ، وَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ، ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ ، يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ ، يَفْعَلُ ذَلِكَ ثَلَاثَ مَرَّاتٍ) النفث : نفخ لطيف بلا ريق . رواه البخاري (5017)");
        this.addDikr(db,"اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. ",1,"أذكار النوم","عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ :( وَكَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحِفْظِ زَكَاةِ رَمَضَانَ ، فَأَتَانِي آتٍ ، فَجَعَلَ يَحْثُو مِنْ الطَّعَامِ ، فَأَخَذْتُهُ فَقُلْتُ : لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فَذَكَرَ الْحَدِيثَ - فَقَالَ : إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ ، لَنْ يَزَالَ عَلَيْكَ مِنْ اللَّهِ حَافِظٌ ، وَلَا يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ . فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : صَدَقَكَ وَهُوَ كَذُوبٌ ، ذَاكَ شَيْطَان) رواه البخاري (2311) .ٌ" );
        this.addDikr(db,"سورة البقرة: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n" +
                "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.",1,"أذكار النوم","عَنْ أَبِي مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :( مَنْ قَرَأَ بِالْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ ) .  رواه البخاري (5009) ومسلم (808) اختلف العلماء في معنى كفتاه ، فقيل : من الآفات في ليلته . وقيل : كفتاه من قيام ليلته . ويجوز أن يراد به الأمران ، والله أعلم .");
        this.addDikr(db,"بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا. ",1,"أذكار النوم","عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ رضي الله عنه قَالَ :( كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ قَالَ بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا وَإِذَا اسْتَيْقَظَ مِنْ مَنَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ) رواه البخاري (6324)");
        this.addDikr(db,"اللهم إني أسلمت نفسي إليك ، ووجهت وجهي إليك ، وفوضت أمري إليك ، وألجأت ظهري إليك ، رغبة ورهبة إليك ، لا ملجأ ولا منجا منك إلا إليك ، آمنت بكتابك الذي أنزلت ، ونبيك الذي أرسلت",1,"أذكار النوم","عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ( إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الْأَيْمَنِ ، ثُمَّ قُلْ : اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ : وَفَوَّضْتُ أَمْرِي إِلَيْكَ ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ ، رَغْبَةً وَرَهْبَةً إِلَيْكَ ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ ، اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ . فَإِنْ مُتَّ مِنْ لَيْلَتِكَ فَأَنْتَ عَلَى الْفِطْرَةِ ، وَاجْعَلْهُنَّ آخِرَ مَا تَتَكَلَّمُ بِهِ ، قَالَ : فَرَدَّدْتُهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَلَمَّا بَلَغْتُ : اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ . قُلْتُ : وَرَسُولِكَ . قَالَ : لَا ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ ) رواه البخاري (6311) ، ومسلم (2710) .");
        this.addDikr(db," باسمك ربي وضعت جنبي ، وبك أرفعه ، إن أمسكت نفسي فارحمها ، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين",1,"أذكار النوم","عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :( إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ فَإِنَّهُ لَا يَدْرِي مَا خَلَفَهُ عَلَيْهِ ثُمَّ يَقُولُ : بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي ، وَبِكَ أَرْفَعُهُ ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا ، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ ) رواه البخاري (6320) ، ومسلم (2714)");
        this.addDikr(db,"سُبْحَان اللَّه الحَمْدُ لِلّه اللَّهُ أكْبَرُ",33,"أذكار النوم","عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رضي الله عنه أَنَّ فَاطِمَةَ رضي الله عنها أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْأَلُهُ خَادِمًا ، فَقَالَ :( أَلَا أُخْبِرُكِ مَا هُوَ خَيْرٌ لَكِ مِنْهُ ، تُسَبِّحِينَ اللَّهَ عِنْدَ مَنَامِكِ ثَلَاثًا وَثَلَاثِينَ ، وَتَحْمَدِينَ اللَّهَ ثَلَاثًا وَثَلَاثِينَ ، وَتُكَبِّرِينَ اللَّهَ أَرْبَعًا وَثَلَاثِينَ . فَمَا تَرَكْتُهَا بَعْدُ . قِيلَ : وَلَا لَيْلَةَ صِفِّينَ ؟ قَالَ : وَلَا لَيْلَةَ صِفِّينَ )  رواه البخاري (5362) ، ومسلم (2727)");
        this.addDikr(db,"اللهم قني عذابك يوم تبعث عبادك",3,"أذكار النوم","عَنْ حَفْصَةَ رضي الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ أَنْ يَرْقُدَ وَضَعَ يَدَهُ الْيُمْنَى تَحْتَ خَدِّهِ ثُمَّ يَقُولُ : ( اللَّهُمَّ قِنِى عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ ) ثَلاَثَ مِرَارٍ .رواه أبو داود (5045) وصححه الحافظ ابن حجر في فتح الباري  (11/119).");
        this.addDikr(db," الحمد لله الذي أطعمنا وسقانا ، وكفانا وآوانا ، فكم ممن لا كافي له ولا مؤوي",1,"أذكار النوم","عَنْ أَنَسٍ رضي الله عنه أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ :( الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ ) رواه مسلم ( 2715 )");
        this.addDikr(db,"اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا ، لَكَ مَمَاتُهَا وَمَحْيَاهَا ، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا ، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ",1,"أذكار النوم","عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ أَمَرَ رَجُلًا إِذَا أَخَذَ مَضْجَعَهُ قَالَ :( اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا ، لَكَ مَمَاتُهَا وَمَحْيَاهَا ، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا ، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ ) فَقَالَ لَهُ رَجُلٌ : أَسَمِعْتَ هَذَا مِنْ عُمَرَ ؟ فَقَالَ : مِنْ خَيْرٍ مِنْ عُمَرَ ، مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ .  رواه مسلم ( 2712 )");
        this.addDikr(db,"اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ ، فَالِقَ الْحَبِّ وَالنَّوَى ، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ ، اقْضِ عَنَّا الدَّيْنَ ، وَأَغْنِنَا مِنْ الْفَقْرِ",1,"أذكار النوم","عن سهيل قال : كَانَ أَبُو صَالِحٍ يَأْمُرُنَا - إِذَا أَرَادَ أَحَدُنَا أَنْ يَنَامَ - أَنْ يَضْطَجِعَ عَلَى شِقِّهِ الْأَيْمَنِ ثُمَّ يَقُولُ :( اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ ، فَالِقَ الْحَبِّ وَالنَّوَى ، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ ، اقْضِ عَنَّا الدَّيْنَ ، وَأَغْنِنَا مِنْ الْفَقْرِ )وَكَانَ يَرْوِي ذَلِكَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رواه مسلم ( 2713 )");
        this.addDikr(db,"اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ ، اللَّهُمَّ لَا يُهْزَمُ جُنْدُكَ ، وَلَا يُخْلَفُ وَعْدُكَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ، سُبْحَانَكَ وَبِحَمْدِكَ",1,"أذكار النوم","عَنْ عَلِيٍّ رضي الله عنه عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ عِنْدَ مَضْجَعِهِ :( اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ ، اللَّهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ ، اللَّهُمَّ لَا يُهْزَمُ جُنْدُكَ ، وَلَا يُخْلَفُ وَعْدُكَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ، سُبْحَانَكَ وَبِحَمْدِكَ ) رواه أبو داود (5052) وصححه النووي في الأذكار  (ص/111)، وابن حجر في  نتائج الأفكار  (2/384)");
        this.addDikr(db,"سورة الإسراء والزمر والسجدة والملك",1,"أذكار النوم","فقد روى أحمد والترمذي عن جابر  رضي الله عنه: أن النبي صلى الله عليه وسلم كان لا ينام حتى يقرأ: ألم* تنزيل، وتبارك الذي بيده الملك.والحديث صححه الألباني في صحيح الجامع.وفي الحديث: كان لا ينام حتى يقرأ بني إسرائيل والزمر. رواه أحمد وصححه الألباني في صحيح الجامع.والله أعلم.");
        this.addDikr(db," سورة الكافرون",1,"أذكار النوم","عن نوفل الأشجعي رضي اللّه عنه قال : قال لي رسول اللّه صلى اللّه عليه وسلم :( اقْرأ : ( قُلْ يا أيُّها الكافِرُونَ ) ثُمَّ نَمْ على خاتِمَتِها ، فإنَّها بَرَاءَةٌ مِنَ الشِّرْكِ )رواه أبو داود (5055) وحسنه ابن حجر في نتائج الأفكار(3/61)");
        this.addDikr(db,"بِسْمِ اللَّهِ وَضَعْتُ جَنْبِي ، اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَأَخْسِئْ شَيْطَانِي ، وَفُكَّ رِهَانِي ، وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلَى",1,"أذكار النوم","عَنْ أَبِي الْأَزْهَرِ الْأَنْمَارِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَخَذَ مَضْجَعَهُ مِنْ اللَّيْلِ قَالَ :( بِسْمِ اللَّهِ وَضَعْتُ جَنْبِي ، اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ، وَأَخْسِئْ شَيْطَانِي ، وَفُكَّ رِهَانِي ، وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلَى )رواه أبو داود (5054)، وحسنه النووي في  الأذكار (ص/125)، والحافظ ابن حجر في نتائج الأفكار (3/60).");
       //sabah
        this.addDikr(db,"اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. ",1,"أذكار الصباح","عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ :( وَكَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحِفْظِ زَكَاةِ رَمَضَانَ ، فَأَتَانِي آتٍ ، فَجَعَلَ يَحْثُو مِنْ الطَّعَامِ ، فَأَخَذْتُهُ فَقُلْتُ : لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فَذَكَرَ الْحَدِيثَ - فَقَالَ : إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ ، لَنْ يَزَالَ عَلَيْكَ مِنْ اللَّهِ حَافِظٌ ، وَلَا يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ . فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : صَدَقَكَ وَهُوَ كَذُوبٌ ، ذَاكَ شَيْطَان) رواه البخاري (2311) .ٌ" );
        this.addDikr(db,"اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",1,"أذكار الصباح","روى البخاري (6306) عن شَدَّاد بْن أَوْسٍ رَضِيَ اللَّهُ عَنْهُ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ : اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ) .قَالَ : ( وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا ، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا ، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ ) ");
        this.addDikr(db,"سُبْحَانَ اللهِ وَبِحَمْدِهِ",100,"أذكار الصباح","روى مسلم (2692) عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي : سُبْحَانَ اللهِ وَبِحَمْدِهِ ، مِائَةَ مَرَّةٍ ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ ، بِأَفْضَلَ مِمَّا جَاءَ بِهِ ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ ، أَوْ زَادَ عَلَيْهِ ) .");
        this.addDikr(db," قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",1,"أذكار الصباح","روى الإمام أحمد في مسنده (6812) والترمذي في سننه (3529) وحسنه ، عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَ : أَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، فَقُلْتُ لَهُ : حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً ، فَقَالَ : هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ( يَا أَبَا بَكْرٍ ، قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ ) ");
        this.addDikr(db,"اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",1,"أذكار الصباح","روى أبو داود (5074) عن ابْن عُمَرَ ، قال : لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ ، حِينَ يُمْسِي ، وَحِينَ يُصْبِحُ : ( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ) .\n" +
                "وصححه الألباني في \"صحيح الأدب المفرد\" وغيره .");
        this.addDikr(db,"اللهُمَّ بِكَ أَصْبَحْنَا ، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ النُّشُورُ",1,"أذكار الصباح","روى أبو داود (5068) والترمذي (3391) والنسائي في \"الكبرى\" (10323) عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ : ( اللهُمَّ بِكَ أَصْبَحْنَا ، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ النُّشُورُ ) وَإِذَا أَمْسَى قَالَ : ( اللَّهُمَّ بِكَ أَمْسَيْنَا ، وَبِكَ أَصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ الْمَصِيرُ ) .\n" +
                "وصححه الألباني في \"صحيح الترمذي");
        this.addDikr(db,"ََلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ",100,"أذكار الصباح","روى البخاري (6040) عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : ( مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، فِي يَوْمٍ مِائَةَ مَرَّةٍ ؛ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ ، وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ ، وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ ، إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ ) .");

        this.addDikr(db,"يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ ، أَصْلِحْ لِي شَأْنِي كُلَّهُ ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",1,"أذكار الصباح","روى النسائي في \"الكبرى\" (227) عن أَنَس بْن مَالِكٍ ، قال : قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِفَاطِمَةَ : ( مَا يَمْنَعُكِ أَنْ تَسْمَعِي مَا أُوصِيكِ بِهِ ، أَنْ تَقُولِي إِذَا أَصْبَحْتِ وَإِذَا أَمْسَيْتِ : يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ ، أَصْلِحْ لِي شَأْنِي كُلَّهُ ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ ) .\n" +
                "وحسنه الألباني في \"الصحيحة\" (227) .");

        this.addDikr(db,"أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ ، وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِاِ اليَوْمِِ وَخَيْرَ مَا بَعْدَهَ ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِا اليَوْمِ وَشَرِّ مَا بَعْدَهَ ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",1,"أذكار الصباح","روى أحمد (18967) عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ ) .\n" +
                "وصححه لغيره محققو المسند.");
        this.addDikr(db,"رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",3,"أذكار الصباح","روى أحمد (18967) عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ ) .\n" +
                "وصححه لغيره محققو المسند.");
        this.addDikr(db," قُلْ هُوَ اللَّهُ أَحَدٌ  ، وَالمُعَوِّذَتَيْنِ",3,"أذكار الصباح"," وعن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : \" قُلْ هُوَ اللَّهُ أَحَدٌ \" ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ )  رواه الترمذي (3575) وصححه ، وأبو داود (5082) . وصححه النووي في \"الأذكار\" (ص107) ، وحسنه ابن حجر في \"نتائج الأفكار\" (2/345) ، والألباني في \"صحيح الترمذي\"");
        this.addDikr(db,"بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",3,"أذكار الصباح","عن عثمان بن عفان رضي الله عنه قال : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : ( مَنْ قَالَ : بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ ) . رواه أبو داود (5088) .");
        this.addDikr(db,"حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",7,"أذكار الصباح","روى أبو داود (5081) عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : ( مَنْ قَالَ إِذَا أَصْبَحَ وَإِذَا أَمْسَى ، حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ، سَبْعَ مَرَّاتٍ ، كَفَاهُ اللَّهُ مَا أَهَمَّهُ ) .");
        this.addDikr(db,"سُبْحَانَ اللهِ وَبِحَمْدِهِ ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",3,"أذكار الصباح","روى مسلم (2726) عَنْ جُوَيْرِيَةَ ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ ، وَهِيَ فِي مَسْجِدِهَا ، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى ، وَهِيَ جَالِسَةٌ ، فَقَالَ : مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا ؟ قَالَتْ : نَعَمْ ، قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ، ثَلَاثَ مَرَّات ٍ، لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ : سُبْحَانَ اللهِ وَبِحَمْدِهِ ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ ) .");
        this.addDikr(db,"اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ",1,"أذكار الصباح","قال رسول الله - صلى الله عليه وسلم-: (من قالَ حينَ يصبحُ اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ فقد أدَّى شكرَ يومِهِ ومن قالَ مثلَ ذلكَ حينَ يمسي فقد أدَّى شكرَ ليلتِهِ).");
        this.addDikr(db," اللَّهمَّ إنِّي أصبحتُ أشْهدُكَ وأشْهدُ حملةَ عرشِكَ وملائِكتَكَ وجميعَ خلقِكَ أنَّكَ أنتَ اللَّهُ لا إلَهَ إلَّا أنتَ وحدَكَ لا شريكَ لَكَ وأنَّ محمَّدًا عبدُكَ ورسولُكَ",1,"أذكار الصباح"," ( من قالَ حينَ يصبحُ اللَّهمَّ إنِّي أصبحتُ أشْهدُكَ وأشْهدُ حملةَ عرشِكَ وملائِكتَكَ وجميعَ خلقِكَ أنَّكَ أنتَ اللَّهُ لا إلَهَ إلَّا أنتَ وحدَكَ لا شريكَ لَكَ وأنَّ محمَّدًا عبدُكَ ورسولُكَ إلَّا غفرَ لَهُ ما أصابَ في يومِهِ ذلِكَ من ذنبٍ وإن قالَها حينَ يمسي غفرَ لَهُ ما أصابَ تلْكَ اللَّيلةَ ) الراوي : أنس بن مالك | المحدث : أبو داود | المصدر : سنن أبي داود");
        //masae
        this.addDikr(db,"سُبْحَانَ اللهِ وَبِحَمْدِهِ",100,"أذكار المساء","روى مسلم (2692) عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي : سُبْحَانَ اللهِ وَبِحَمْدِهِ ، مِائَةَ مَرَّةٍ ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ ، بِأَفْضَلَ مِمَّا جَاءَ بِهِ ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ ، أَوْ زَادَ عَلَيْهِ ) .");
        this.addDikr(db,"اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",1,"أذكار المساء","روى البخاري (6306) عن شَدَّاد بْن أَوْسٍ رَضِيَ اللَّهُ عَنْهُ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ : اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ) .قَالَ : ( وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا ، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا ، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ ) ");
        this.addDikr(db,"أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",1,"أذكار المساء","روى مسلم (2709) عَنْ أَبِي هُرَيْرَةَ ، أَنَّهُ قَالَ : جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : يَا رَسُولَ اللهِ مَا لَقِيتُ مِنْ عَقْرَبٍ لَدَغَتْنِي الْبَارِحَةَ ، قَالَ : ( أَمَا لَوْ قُلْتَ ، حِينَ أَمْسَيْتَ : أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ، لَمْ تَضُرَّكَ )");
        this.addDikr(db," قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",1,"أذكار المساء","روى الإمام أحمد في مسنده (6812) والترمذي في سننه (3529) وحسنه ، عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَ : أَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، فَقُلْتُ لَهُ : حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً ، فَقَالَ : هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ( يَا أَبَا بَكْرٍ ، قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ ) ");
        this.addDikr(db,"اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",1,"أذكار المساء","روى أبو داود (5074) عن ابْن عُمَرَ ، قال : لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ ، حِينَ يُمْسِي ، وَحِينَ يُصْبِحُ : ( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ) .\n" +
                "وصححه الألباني في \"صحيح الأدب المفرد\" وغيره .");
        this.addDikr(db,"اللَّهُمَّ بِكَ أَمْسَيْنَا ، وَبِكَ أَصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ الْمَصِيرُ ",1,"أذكار المساء","روى أبو داود (5068) والترمذي (3391) والنسائي في \"الكبرى\" (10323) عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ : ( اللهُمَّ بِكَ أَصْبَحْنَا ، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ النُّشُورُ ) وَإِذَا أَمْسَى قَالَ : ( اللَّهُمَّ بِكَ أَمْسَيْنَا ، وَبِكَ أَصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ الْمَصِيرُ ) .\n" +
                "وصححه الألباني في \"صحيح الترمذي");
        this.addDikr(db,"لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ",100,"أذكار المساء","روى البخاري (6040) عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : ( مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، فِي يَوْمٍ مِائَةَ مَرَّةٍ ؛ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ ، وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ ، وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ ، إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ ) .");
        this.addDikr(db,"يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ ، أَصْلِحْ لِي شَأْنِي كُلَّهُ ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",1,"أذكار المساء","روى النسائي في \"الكبرى\" (227) عن أَنَس بْن مَالِكٍ ، قال : قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِفَاطِمَةَ : ( مَا يَمْنَعُكِ أَنْ تَسْمَعِي مَا أُوصِيكِ بِهِ ، أَنْ تَقُولِي إِذَا أَصْبَحْتِ وَإِذَا أَمْسَيْتِ : يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ ، أَصْلِحْ لِي شَأْنِي كُلَّهُ ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ ) .\n" +
                "وحسنه الألباني في \"الصحيحة\" (227) .");
        this.addDikr(db,"أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ ، وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",1,"أذكار المساء","روى أحمد (18967) عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ ) .\n" +
                "وصححه لغيره محققو المسند.");
        this.addDikr(db,"رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",3,"أذكار المساء","روى أحمد (18967) عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ ) .\n" +
                "وصححه لغيره محققو المسند.");
        this.addDikr(db," قُلْ هُوَ اللَّهُ أَحَدٌ  ، وَالمُعَوِّذَتَيْنِ",3,"أذكار المساء"," وعن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : \" قُلْ هُوَ اللَّهُ أَحَدٌ \" ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) رواه الترمذي (3575) وصححه ، وأبو داود (5082) . وصححه النووي في \"الأذكار\" (ص107) ، وحسنه ابن حجر في \"نتائج الأفكار\" (2/345) ، والألباني في \"صحيح الترمذي\" ");
        this.addDikr(db,"بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",3,"أذكار المساء","عن عثمان بن عفان رضي الله عنه قال : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : ( مَنْ قَالَ : بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ ) . رواه أبو داود (5088) .");
        this.addDikr(db,"حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",7,"أذكار المساء","روى أبو داود (5081) عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : ( مَنْ قَالَ إِذَا أَصْبَحَ وَإِذَا أَمْسَى ، حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ، سَبْعَ مَرَّاتٍ ، كَفَاهُ اللَّهُ مَا أَهَمَّهُ ) .");
        this.addDikr(db," اللَّهمَّ إنِّي أمْسَيْتُ أشْهدُكَ وأشْهدُ حملةَ عرشِكَ وملائِكتَكَ وجميعَ خلقِكَ أنَّكَ أنتَ اللَّهُ لا إلَهَ إلَّا أنتَ وحدَكَ لا شريكَ لَكَ وأنَّ محمَّدًا عبدُكَ ورسولُكَ",1,"أذكار المساء"," ( من قالَ حينَ يصبحُ اللَّهمَّ إنِّي أصبحتُ أشْهدُكَ وأشْهدُ حملةَ عرشِكَ وملائِكتَكَ وجميعَ خلقِكَ أنَّكَ أنتَ اللَّهُ لا إلَهَ إلَّا أنتَ وحدَكَ لا شريكَ لَكَ وأنَّ محمَّدًا عبدُكَ ورسولُكَ إلَّا غفرَ لَهُ ما أصابَ في يومِهِ ذلِكَ من ذنبٍ وإن قالَها حينَ يمسي غفرَ لَهُ ما أصابَ تلْكَ اللَّيلةَ ) الراوي : أنس بن مالك | المحدث : أبو داود | المصدر : سنن أبي داود");
        this.addDikr(db,"اللَّهمَّ ما أَمْسَى بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ",1,"أذكار المساء","قال رسول الله - صلى الله عليه وسلم-: (من قالَ حينَ يصبحُ اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ فقد أدَّى شكرَ يومِهِ ومن قالَ مثلَ ذلكَ حينَ يمسي فقد أدَّى شكرَ ليلتِهِ).");
       //Adkar after Salat
        this.addDikr(db,"أستغفر الله",3,"أذكار الصلاة"," في صحيح مسلم عَنْ ثَوْبَانَ قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، إِذَا انْصَرَفَ مِنْ صَلاتِهِ، اسْتَغْفَرَ ثَلاثًا، وَقَالَ: اللهُمَّ، أَنْتَ السَّلامُ، وَمِنْكَ السَّلامُ، تَبَارَكْتَ ذَا الْجَلالِ وَالإِكْرَامِ.");
        this.addDikr(db,"اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الجَلَالِ وَالإِكْرَامِ.",1,"أذكار الصلاة","كانَ النبيُّ صَلَّى اللَّهُ عليه وسلَّمَ إذَا سَلَّمَ لَمْ يَقْعُدْ إلَّا مِقْدَارَ ما يقولُ: اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الجَلَالِ وَالإِكْرَامِ. وفي رِوَايَةِ ابْنِ نُمَيْرٍ يا ذَا الجَلَالِ وَالإِكْرَامِ. *الراوي:عائشة أم المؤمنين *المحدث:مسلم *المصدر:صحيح مسلم *الجزء أو الصفحة:592 *حكم المحدث:[صحيح]");
        this.addDikr(db,"لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ، وله الحَمْدُ، وهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ.",1    ,"أذكار الصلاة","أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ يقولُ في دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ: لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ، وله الحَمْدُ، وهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ. وقالَ شُعْبَةُ: عن عبدِ المَلِكِ بنِ عُمَيْرٍ، بهذا، وعَنِ الحَكَمِ، عَنِ القَاسِمِ بنِ مُخَيْمِرَةَ، عن ورَّادٍ، بهذا، وقالَ الحَسَنُ: الجَدُّ: غِنًى. *الراوي:المغيرة بن شعبة *المحدث:البخاري *المصدر:صحيح البخاري *الجزء أو الصفحة:844 *حكم المحدث:[صحيح]");
        this.addDikr(db," أقرأَ المُعوِّذاتِ ",1,"أذكار الصلاة","أمرني رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ أن أقرأَ المُعوِّذاتِ دُبُرَ كلِّ صلاةٍ *الراوي:عقبة بن عامر *المحدث:الذهبي *لمصدر:ميزان الاعتدال *الجزء أو الصفحة:4/433 *حكم المحدث:حسن غريب ");
        this.addDikr(db,"اللهمَّ أعنِّي على ذكرِك وشكرِك وحسنِ عبادَتِك",1,"أذكار الصلاة","لا تدَعنَّ دبرَ كلِّ صلاةٍ أنْ تقولَ اللهمَّ أعني على ذكرِك وشكرِكَ وحُسنِ عبادتِكَ *الراوي:معاذ بن جبل *المحدث:ابن باز *المصدر:مجموع فتاوى ابن باز *الجزء أو الصفحة:25/157  *حكم المحدث:إسناده صحيح");
        this.addDikr(db,"اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. ",1,"أذكار الصلاة","قال الإمام النسائي رحمه الله في \" السنن الكبرى \" (9848) :أَخْبَرَنَا الْحُسَيْنُ بْنُ بِشْرٍ ، بِطَرَسُوسَ ، كَتَبْنَا عَنْهُ قَالَ : حَدَّثَنَا مُحَمَّدُ بْنُ حِمْيَرٍ قَالَ : حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ ، عَنْ أَبِي أُمَامَةَ قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَنْ قَرَأَ آيَةَ الْكُرْسِيِّ فِي دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ لَمْ يَمْنَعْهُ مِنْ دُخُولِ الْجَنَّةِ إِلَّا أَنْ يَمُوتَ ) .");
        this.addDikr(db,"سُبْحَان اللَّه الحَمْدُ لِلّه اللَّهُ أكْبَرُ",33,"أذكار الصلاة","جاء في حديث أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" مَنْ سَبَّحَ اللَّهَ فِي دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وَثَلاثِينَ وَحَمِدَ اللَّهَ ثَلاثًا وَثَلاثِينَ وَكَبَّرَ اللَّهَ ثَلاثًا وَثَلاثِينَ فَتْلِكَ تِسْعَةٌ وَتِسْعُونَ وَقَالَ تَمَامَ الْمِائَةِ لا إِلَهَ إِلاّ اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ غُفِرَتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ . \" رواه مسلم 939");
        this.addDikr(db,"لا إِلَهَ إِلاّ اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",1,"أذكار الصلاة","جاء في حديث أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" مَنْ سَبَّحَ اللَّهَ فِي دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وَثَلاثِينَ وَحَمِدَ اللَّهَ ثَلاثًا وَثَلاثِينَ وَكَبَّرَ اللَّهَ ثَلاثًا وَثَلاثِينَ فَتْلِكَ تِسْعَةٌ وَتِسْعُونَ وَقَالَ تَمَامَ الْمِائَةِ لا إِلَهَ إِلاّ اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ غُفِرَتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ . \" رواه مسلم 939");

    }
    void addDikr(SQLiteDatabase db,String dikrText, int dikrnbR,String dikrType, String dikrSource){
        ContentValues cv = new ContentValues();
        cv.put("DIK_TEXT",dikrText);
        cv.put("DIKR_NbR",dikrnbR);
        cv.put("DIKR_TYPE",dikrType);
        cv.put("DIKR_Source",dikrSource);
        long result = db.insert("ADKAR",null,cv);
        if (result == -1){
            Toast.makeText(context, "failed dikr", Toast.LENGTH_SHORT).show();
        }else{
           // Toast.makeText(context, "secceded dikr", Toast.LENGTH_SHORT).show();
        }
    }
    void addProgress(int fajer,int doher,int aser,int maghrib,int ichae){
        ContentValues cv = new ContentValues();
        SQLiteDatabase db = this.getWritableDatabase();
        cv.put("Fajer",fajer);
        cv.put("Doher",doher);
        cv.put("Aser",aser);
        cv.put("Magrib",maghrib);
        cv.put("Icha",ichae);
        long result = db.insert("progress",null,cv);
        if (result == -1){
            Toast.makeText(context, "failed", Toast.LENGTH_SHORT).show();
        }else{
            Toast.makeText(context, "progress added sccessfully", Toast.LENGTH_SHORT).show();
        }
    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_NAME);
        db.execSQL("DROP TABLE IF EXISTS ADKAR");
        onCreate(db);
    }
    Cursor readAllData(){
        SQLiteDatabase db = getDatabase();
        String query = "SELECT * FROM " + TABLE_NAME;
        Cursor cursor = null;
        if(db != null){
            cursor = db.rawQuery(query,null);

        }
        return cursor;
    }
    Cursor readAdkarNawm(){
        String query = "SELECT * FROM ADKAR WHERE DIKR_TYPE = 'أذكار النوم';";
        SQLiteDatabase db = this.getReadableDatabase();
        Cursor cursor = null;
        if(db != null){
            cursor = db.rawQuery(query,null);
        }
        return cursor;
    }
    Cursor readAdkarSabah(){
        String query = "SELECT * FROM ADKAR WHERE DIKR_TYPE = 'أذكار الصباح';";
        SQLiteDatabase db = this.getReadableDatabase();
        Cursor cursor = null;
        if(db != null){
            cursor = db.rawQuery(query,null);
        }
        return cursor;
    }
    Cursor readAdkarMasae(){
        String query = "SELECT * FROM ADKAR WHERE DIKR_TYPE = 'أذكار المساء';";
        SQLiteDatabase db = this.getReadableDatabase();
        Cursor cursor = null;
        if(db != null){
            cursor = db.rawQuery(query,null);
        }
        return cursor;
    }
    Cursor readAdkarBadSalat(){
        String query = "SELECT * FROM ADKAR WHERE DIKR_TYPE = 'أذكار الصلاة';";
        SQLiteDatabase db = this.getReadableDatabase();
        Cursor cursor = null;
        if(db != null){
            cursor = db.rawQuery(query,null);
        }
        return cursor;
    }
    boolean idAdded(){
        SQLiteDatabase db = getDatabase();
        String query = "SELECT * FROM progress WHERE strftime('%Y-%m-%d', date) = date('now');";
        Cursor cursor = db.rawQuery(query,null);
        if(cursor != null && cursor.getCount()!=0){
            return true;

        }else return false;

    }
    Cursor readWeekProgress(){
        SQLiteDatabase db = this.getReadableDatabase();
        String query = "SELECT * FROM progress";
        Cursor cursor = db.rawQuery(query,null);
        if(cursor != null){

            return cursor;
        }else{
            return  null;
        }

    }

}
